package com.exchangeratesnbu.entity;

public enum CurrencyLiteralCode {
    USD("Долар США"),
    EUR("Євро"),
    PLN("Злотий"),
    GBP("Фунт стерлінгів"),
    HUF("Форинт"),
    CZK("Чеська крона"),
    SEK("Шведська крона"),
    CHF("Швейцарський франк"),
    NOK("Норвезька крона"),
    GEL("Ларi"),
    CAD("Канадський долар"),
    AUD("Австралійський долар"),
    AZN("Азербайджанський манат"),
    DZD("Алжирський динар"),
    BYN("Бiлоруський рубль"),
    THB("Бат"),
    BGN("Болгарський лев"),
    AMD("Вiрменський драм"),
    KRW("Вона"),
    GHS("Ганських седі"),
    HKD("Гонконгівський долар"),
    DKK("Данська крона"),
    AED("Дирхам ОАЕ"),
    VND("Донг"),
    EGP("Єгипетський фунт"),
    JPY("Єна"),
    INR("Індійська рупія"),
    IQD("Іракський динар"),
    IRR("Іранський ріал"),
    HRK("Куна"),
    LBP("Ліванський фунт"),
    LYD("Лівійський динар"),
    MYR("Малайзійський ринггіт"),
    MAD("Марокканський дирхам"),
    MXN("Мексіканський песо"),
    MDL("Молдовський лей"),
    ILS("Новий ізраїльський шекель"),
    TWD("Новий тайванський долар"),
    NZD("Новозеландський долар"),
    PKR("Пакистанська рупія"),
    ZAR("Ренд"),
    RUB("Російський рубль"),
    RON("Румунський лей"),
    IDR("Рупія"),
    SAR("Саудівський рiял"),
    RSD("Сербський динар"),
    SGD("Сінгапурський долар"),
    KGS("Сом"),
    TJS("Сомонi"),
    BDT("Така"),
    KZT("Теньге"),
    TND("Туніський динар"),
    TRY("Турецька ліра"),
    TMT("Туркменський новий манат"),
    UZS("Узбецький сум"),
    CNY("Юань Женьмiньбi");

    CurrencyLiteralCode(String description) {
        this.description = description;
    }

    private String description;

    public String getDescription() {
        return description;
    }
}